import numpy as np

scores = np.array([[90, 80, 70, 60],
                   [85, 85, 85, 85],
                   [70, 75, 80, 85],
                   [60, 65, 70, 75],
                   [95, 90, 85, 80]])     # 5 个学生 × 4 门课

add = np.arange(1, 6).reshape(5, 1)      # 每个学生一个加分：1~5
adjust = np.array([-5, 0, 5, 10])        # 每门课一个调整分
# (5,4) + (5,1) + (1,4)
result = scores + add + adjust



X = np.array([[1., 2.],
              [2., 1.],
              [3., 4.],
              [4., 3.]])      # 4 个样本，每个 2 个特征

w = np.array([[2.],
              [3.]])          # 2 个权重，竖着写

b = 1.0                        # 偏置

# (4,2) @ (2,1) + 1 = (4,1) + 1
y = X @ w + b


